Revit 2026 API

# MetallicPaintCommonTintToggle Property

---

The property labeled "Tint" from the "MetallicPaint" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string CommonTintToggle { get; }
```
```vb
Public Shared ReadOnly Property CommonTintToggle As String
	Get
```
```cpp
public:
static property String^ CommonTintToggle {
	String^ get ();
}
```
```fsharp
static member CommonTintToggle : string with get
```

#### Property Value

String

This property is of type "AssetPropertyBoolean".

#### Reference

MetallicPaint Class

Autodesk.Revit.DB.Visual Namespace